xml/request/fetchDataRequest2.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:voxb="http://oss.dbc.dk/ns/voxb">
   <soapenv:Header/>
   <soapenv:Body>
      <voxb:fetchDataRequest>
         <!--1 or more repetitions:-->
         <voxb:fetchData>
            <voxb:objectIdentifierValue>9788776905774</voxb:objectIdentifierValue>
            <voxb:objectIdentifierType>ISBN</voxb:objectIdentifierType>
            <voxb:institutionId>1</voxb:institutionId>
         </voxb:fetchData>
         <voxb:output>
            <!--1 or more repetitions:-->
            <voxb:contentType>all</voxb:contentType>
         </voxb:output>
      </voxb:fetchDataRequest>
   </soapenv:Body>
</soapenv:Envelope>
