xml/request/fetchMyDataRequest.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:voxb="http://oss.dbc.dk/ns/voxb">
   <soapenv:Body>
      <voxb:fetchMyDataRequest>
         <voxb:userId>29</voxb:userId>
      </voxb:fetchMyDataRequest>
   </soapenv:Body>
</soapenv:Envelope>