xml/request/updateMyDataRequest.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:voxb="http://oss.dbc.dk/ns/voxb">
   <soapenv:Body>
      <voxb:updateMyDataRequest>
         <voxb:voxbIdentifier>16</voxb:voxbIdentifier>
         <voxb:institutionId>1</voxb:institutionId>
         <voxb:item>
            <!--Optional:-->
            <voxb:rating>13</voxb:rating>
            <!--Optional:-->
            <voxb:tags>
               <!--1 or more repetitions:-->
               <voxb:tag>tag4</voxb:tag>
            </voxb:tags>
            <!--Optional:-->
            <voxb:review>
               <!--Optional:-->
               <voxb:reviewTitle>Opdateret anmeldelse</voxb:reviewTitle>
               <voxb:reviewData>Stadigvæk god</voxb:reviewData>
               <voxb:reviewType>TXT</voxb:reviewType>
            </voxb:review>
         </voxb:item>
         <voxb:object>
            <voxb:objectIdentifierValue>9781577316176</voxb:objectIdentifierValue>
            <voxb:objectIdentifierType>ISBN</voxb:objectIdentifierType>
         </voxb:object>
      </voxb:updateMyDataRequest>
   </soapenv:Body>
</soapenv:Envelope>
