xml/request/searchDataRequest.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:voxb="http://oss.dbc.dk/ns/voxb">
   <soapenv:Body>
      <voxb:searchDataRequest>
         <voxb:searchString>tag4</voxb:searchString>
         <voxb:qualifier>TAG</voxb:qualifier>
      </voxb:searchDataRequest>
   </soapenv:Body>
</soapenv:Envelope>