xml/request/undeleteMyDataRequest.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:voxb="http://oss.dbc.dk/ns/voxb">
   <soapenv:Body>
      <voxb:undeleteMyDataRequest>
         <voxb:voxbIdentifier>16</voxb:voxbIdentifier>
      </voxb:undeleteMyDataRequest>
   </soapenv:Body>
</soapenv:Envelope>