xml/request/createUserRequest.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:voxb="http://oss.dbc.dk/ns/voxb">
   <soapenv:Body>
      <voxb:createUserRequest>
         <voxb:userAlias>
            <voxb:aliasName>AndersVestergaard</voxb:aliasName>
            <voxb:profileLink>facebook.com/andersv</voxb:profileLink>
         </voxb:userAlias>
         <voxb:authenticationFingerprint>
            <voxb:userIdentifierValue>1904811233</voxb:userIdentifierValue>
            <voxb:userIdentifierType>CPR</voxb:userIdentifierType>
            <voxb:identityProvider>Testbibliotek</voxb:identityProvider>
            <voxb:institutionId>1</voxb:institutionId>
         </voxb:authenticationFingerprint>
      </voxb:createUserRequest>
   </soapenv:Body>
</soapenv:Envelope>
