xml/request/createMyDataRequest2.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:voxb="http://oss.dbc.dk/ns/voxb">
   <soapenv:Body>
      <voxb:createMyDataRequest>
         <voxb:userId>31</voxb:userId>
         <voxb:item>
            <!--Optional:-->
            <voxb:rating>77</voxb:rating>
            <!--Optional:-->
            <voxb:tags>
               <!--1 or more repetitions:-->
               <voxb:tag>tag1</voxb:tag>
	       <voxb:tag>tag3</voxb:tag>
            </voxb:tags>
         </voxb:item>
         <voxb:object>
            <!--Optional:-->
            <voxb:objectContributors>Ellen Siever</voxb:objectContributors>
            <voxb:objectIdentifierValue>0596004826</voxb:objectIdentifierValue>
            <voxb:objectIdentifierType>ISBN</voxb:objectIdentifierType>
            <!--Optional:-->
            <voxb:objectMaterialType>Bog</voxb:objectMaterialType>
            <!--Optional:-->
            <voxb:objectPublicationYear>2001</voxb:objectPublicationYear>
            <!--Optional:-->
            <voxb:objectTitle>Linux in a Nutshell</voxb:objectTitle>
         </voxb:object>
      </voxb:createMyDataRequest>
   </soapenv:Body>
</soapenv:Envelope>