xml/request/fetchUserRequest2.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:voxb="http://oss.dbc.dk/ns/voxb">
   <soapenv:Body>
      <voxb:fetchUserRequest>
         <voxb:authenticationFingerprint>
            <voxb:userIdentifierValue>0101</voxb:userIdentifierValue>
            <voxb:userIdentifierType>local</voxb:userIdentifierType>
            <voxb:identityProvider>KKB</voxb:identityProvider>
            <voxb:institutionId>1</voxb:institutionId>
         </voxb:authenticationFingerprint>
      </voxb:fetchUserRequest>
   </soapenv:Body>
</soapenv:Envelope>
